package com.shitouren.core.config.exception;

/**
 * @Autho： 王涛
 * @DATE： 2019/1/19 9:37
 */
@SuppressWarnings("ALL")
public enum ExceptionConstant {


    处理成功("10000", "处理成功！"),
    参数异常("400", "参数异常"),
    登录失效("401", "您尚未登录或登录过期，请前往登录！"),
    签名错误("402", "签名错误！"),
    请求不存在("404", "请求不存在"),
    账号在其他设备登录("403", "账号在其他设备登录"),
    退出失败("405", "退出失败！"),
    没有权限访问("407", "没有权限请求资源，请联系管理员"),
    上传失败("408", "上传失败"),
    请求失败("00001", "请求失败！"),
    服务器错误("00002", "服务器错误！"),
    请求错误("00003", "请求错误"),
    参数解析错误("00004", "请检查参数格式和参数类型"),
    服务不可用("00006", "服务不可用"),

    该账号正在审核("12107", "该账号正在审核"),
    该账号已实名("12108", "该账号已实名"),
    资产不足("12109", "资产不足"),
    请先进行实名认证("12004", "请先进行实名认证"),
    该账号已实名或正在审核中("12008", "该账号已实名或正在审核中"),
    设备IP占用("12013", "您的设备IP已被占用，请使用其他设备进行注册"),
    原密码错误("19001", "原密码错误"),
    此身份已实名不可重复("13009", "此身份已实名不可重复"),
    手机号有误("230026", "手机号有误"),
    对方不是你的下级("230027", "对方不是你的下级"),
    订单已过期("230028", "订单已过期"),
    生成失败("230029", "生成失败"),
    数量有误("230030", "数量有误"),
    金额错误("230030", "金额错误"),
    请先设置操作密码("230031", "请先设置操作密码"),
    授权失败("230031", "授权失败"),
    暂未开启("230032", "暂未开启"),
    盲盒未到开启时间("230032", "盲盒未到开启时间"),
    盲盒开启时间已结束("230032", "盲盒开启时间已结束"),
    库存不足("230032", "库存不足"),
    操作密码错误("230032", "操作密码错误"),
    转赠时间未到("230032", "转赠时间未到"),
    请先设置支付宝("230033", "请先设置支付宝"),
    无此订单("230033", "无此订单"),
    没有优先购资格("230033", "没有优先购资格"),
    不在报名时间内("230033", "不在报名时间内"),
    今日已签到("230033", "今日已签到"),
    无数据("230033", "无数据"),
    价格有误("230034", "价格有误"),
    查无此人("230035", "查无此人"),
    没有预约资格("230035", "没有预约资格"),
    预约时间未到("230035", "预约时间未到"),
    正在交易无法撤回("230036", "正在交易无法撤回"),
    已售完("230037", "已售完"),
    该藏品有未支付订单("230038", "该藏品有未支付订单"),
    认证失败("230039", "认证失败"),
    你已报名("230039", "你已报名"),
    已预售完("230039", "已预售完"),
    合成暂未开始("230040", "合成暂未开始"),
    本轮合成已结束("230041", "本轮合成已结束"),
    项目还在内测阶段("230041", "项目还在内测阶段"),
    碎片未集齐("230042", "碎片未集齐"),
    暂未开放("230043", "暂未开放"),
    鲸币不足("230043", "鲸币不足"),
    暂未发放请稍等("230044", "暂未发放请稍等"),
    该藏品是你的无法购买("230045", "该藏品是你的无法购买"),
    藏品已被交易("230046", "藏品已被交易"),
    藏品已被锁仓("230046", "藏品已被锁仓"),
    该藏品已达限购量("230047", "该藏品已达限购量"),
    已售光("230047", "已售光"),
    支付宝账号一年只能更换一次("230048", "支付宝账号一年只能更换一次"),
    请勿进行非法操作("230049", "请勿进行非法操作"),
    该实名信息已达认证上限("230050", "该实名信息已达认证上限"),
    出售超出最大限额("230051", "出售超出最大限额"),

    //---------------------------------账号相关---------------------------------------------//
    获取token失败("110001", "获取token失败，请重新登录"),
    发送短信失败("11002", "发送短信失败"),
    手机验证码错误("11003", "手机验证码错误"),
    更换账号("11004", "更换账号，请重新登录"),
    账号不存在("11005", "账号不存在"),
    账户名不存在("21005", "账户名不存在"),
    账号或密码错误("11006", "账号或密码错误"),
    账号已被禁用("11007", "账号已被禁用"),
    账号已存在("11008", "账号已存在，可以直接登录"),
    账户名已存在("21008", "账户名已存在"),
    两次密码不一致("11006", "两次密码不一致"),
    请前往APP注册或实名("11009", "请前往APP注册或实名"),
    点赞任务已做完("11010", "这个任务已经被别人做完啦"),
    积分不足("10011", "积分不足"),
    该购物车持有数量已达上限("10012", "该购物车持有数量已达上限"),
    购物车数量不足("10013", "购物车数量不足"),
    今日任务已完成("10014", "今日任务已完成"),
    余额不足("10014", "余额不足"),
    已预约("10014", "已预约"),
    任务不存在("10015", "该任务不存在"),
    酒滴不足("10016", "酒滴不足"),
    未实名不能兑换("10030", "未实名不能兑换"),
    该酒坊采购已达上限("10017", "该酒坊采购已达上限"),
    直推活跃未达到("10019", "直推活跃未达到"),
    求购单价区间不符合("10016", "求购单价应符合单价区间"),
    请先实名("10016", "请先实名"),
    交易密码错误("10018", "交易密码错误"),
    实名未通过("10025", "实名审核未通过"),
    手机号与账号绑定手机号不一致("20026", "手机号与账号绑定手机号不一致"),
    不能重复签到("20025", "不能重复签到"),
    请输入邀请码("10026", "请输入邀请码"),
    邀请码不存在("10027", "邀请码不存在");


    ExceptionConstant(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    private String code;
    private String msg;

}
